results/test1/file/c/fio-4k.txt
random-write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
[...]
Jobs: 4 (f=4): [w(4)][100.0%][w=10.7MiB/s][w=2741 IOPS][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1092: Sat Mar 16 18:55:19 2024
  write: IOPS=1623, BW=6495KiB/s (6651kB/s)(382MiB/60254msec); 0 zone resets
    slat (nsec): min=551, max=53679k, avg=78270.58, stdev=442002.39
    clat (nsec): min=531, max=1025.2M, avg=4678635.41, stdev=52302452.71
     lat (usec): min=18, max=1025.2k, avg=4756.91, stdev=52300.86
    clat percentiles (nsec):
     |  1.00th=[       956],  5.00th=[      3472], 10.00th=[     32640],
     | 20.00th=[    226304], 30.00th=[    333824], 40.00th=[    444416],
     | 50.00th=[    561152], 60.00th=[    708608], 70.00th=[    913408],
     | 80.00th=[   1253376], 90.00th=[   1990656], 95.00th=[   3096576],
     | 99.00th=[  20054016], 99.50th=[ 156237824], 99.90th=[ 868220928],
     | 99.95th=[ 901775360], 99.99th=[1010827264]
   bw (  KiB/s): min=   32, max=16872, per=32.85%, avg=8411.68, stdev=4065.43, samples=92
   iops        : min=    8, max= 4218, avg=2102.82, stdev=1016.29, samples=92
  lat (nsec)   : 750=0.46%, 1000=0.63%
  lat (usec)   : 2=2.00%, 4=2.27%, 10=2.04%, 20=1.54%, 50=1.76%
  lat (usec)   : 100=2.11%, 250=9.73%, 500=22.97%, 750=17.00%, 1000=10.58%
  lat (msec)   : 2=16.97%, 4=6.46%, 10=1.98%, 20=0.52%, 50=0.37%
  lat (msec)   : 100=0.08%, 250=0.09%, 500=0.02%, 750=0.17%, 1000=0.25%
  lat (msec)   : 2000=0.02%
  cpu          : usr=1.95%, sys=33.72%, ctx=212676, majf=0, minf=0
  IO depths    : 1=0.7%, 2=5.4%, 4=54.1%, 8=39.8%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.7%, 8=4.3%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,97832,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1093: Sat Mar 16 18:55:19 2024
  write: IOPS=1585, BW=6341KiB/s (6493kB/s)(373MiB/60275msec); 0 zone resets
    slat (nsec): min=541, max=60337k, avg=88778.59, stdev=547335.27
    clat (nsec): min=531, max=1025.4M, avg=4750201.89, stdev=52932563.88
     lat (usec): min=21, max=1025.4k, avg=4838.98, stdev=52931.96
    clat percentiles (nsec):
     |  1.00th=[       980],  5.00th=[      3120], 10.00th=[     23424],
     | 20.00th=[    218112], 30.00th=[    317440], 40.00th=[    432128],
     | 50.00th=[    536576], 60.00th=[    684032], 70.00th=[    888832],
     | 80.00th=[   1220608], 90.00th=[   1957888], 95.00th=[   2998272],
     | 99.00th=[  20316160], 99.50th=[ 177209344], 99.90th=[ 868220928],
     | 99.95th=[ 910163968], 99.99th=[1002438656]
   bw (  KiB/s): min=  280, max=18536, per=32.45%, avg=8310.71, stdev=3979.51, samples=91
   iops        : min=   70, max= 4634, avg=2077.57, stdev=994.83, samples=91
  lat (nsec)   : 750=0.48%, 1000=0.53%
  lat (usec)   : 2=2.17%, 4=2.56%, 10=2.24%, 20=1.56%, 50=1.95%
  lat (usec)   : 100=2.16%, 250=9.93%, 500=23.32%, 750=16.81%, 1000=10.28%
  lat (msec)   : 2=16.40%, 4=6.27%, 10=1.78%, 20=0.52%, 50=0.37%
  lat (msec)   : 100=0.10%, 250=0.09%, 500=0.03%, 750=0.18%, 1000=0.25%
  lat (msec)   : 2000=0.02%
  cpu          : usr=1.84%, sys=32.02%, ctx=207357, majf=0, minf=0
  IO depths    : 1=0.9%, 2=6.2%, 4=55.3%, 8=37.6%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.2%, 8=4.8%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,95546,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1094: Sat Mar 16 18:55:19 2024
  write: IOPS=1575, BW=6300KiB/s (6451kB/s)(371MiB/60233msec); 0 zone resets
    slat (nsec): min=230, max=53813k, avg=90736.43, stdev=550870.44
    clat (nsec): min=551, max=1018.4M, avg=4780300.51, stdev=53140545.92
     lat (usec): min=19, max=1018.4k, avg=4871.04, stdev=53140.55
    clat percentiles (nsec):
     |  1.00th=[       892],  5.00th=[      2608], 10.00th=[     19328],
     | 20.00th=[    214016], 30.00th=[    313344], 40.00th=[    423936],
     | 50.00th=[    528384], 60.00th=[    675840], 70.00th=[    880640],
     | 80.00th=[   1236992], 90.00th=[   1990656], 95.00th=[   3129344],
     | 99.00th=[  20316160], 99.50th=[ 177209344], 99.90th=[ 876609536],
     | 99.95th=[ 910163968], 99.99th=[1010827264]
   bw (  KiB/s): min=  224, max=20407, per=32.28%, avg=8267.65, stdev=4201.95, samples=91
   iops        : min=   56, max= 5101, avg=2066.81, stdev=1050.40, samples=91
  lat (nsec)   : 750=0.54%, 1000=0.75%
  lat (usec)   : 2=2.58%, 4=2.65%, 10=2.07%, 20=1.51%, 50=1.90%
  lat (usec)   : 100=2.27%, 250=9.73%, 500=23.76%, 750=16.43%, 1000=9.72%
  lat (msec)   : 2=16.15%, 4=6.39%, 10=1.98%, 20=0.56%, 50=0.36%
  lat (msec)   : 100=0.08%, 250=0.09%, 500=0.03%, 750=0.18%, 1000=0.25%
  lat (msec)   : 2000=0.02%
  cpu          : usr=1.84%, sys=32.28%, ctx=207381, majf=0, minf=0
  IO depths    : 1=0.8%, 2=5.8%, 4=55.1%, 8=38.3%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.4%, 8=4.6%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,94869,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1095: Sat Mar 16 18:55:19 2024
  write: IOPS=1619, BW=6479KiB/s (6634kB/s)(381MiB/60266msec); 0 zone resets
    slat (nsec): min=561, max=50376k, avg=82335.72, stdev=505546.66
    clat (nsec): min=562, max=1031.7M, avg=4676060.79, stdev=52376011.17
     lat (usec): min=20, max=1031.7k, avg=4758.40, stdev=52375.51
    clat percentiles (nsec):
     |  1.00th=[      1048],  5.00th=[      3568], 10.00th=[     29056],
     | 20.00th=[    222208], 30.00th=[    325632], 40.00th=[    432128],
     | 50.00th=[    544768], 60.00th=[    692224], 70.00th=[    897024],
     | 80.00th=[   1236992], 90.00th=[   1974272], 95.00th=[   3031040],
     | 99.00th=[  19267584], 99.50th=[ 166723584], 99.90th=[ 868220928],
     | 99.95th=[ 901775360], 99.99th=[1002438656]
   bw (  KiB/s): min=    8, max=19400, per=32.81%, avg=8401.07, stdev=4555.08, samples=92
   iops        : min=    2, max= 4850, avg=2100.18, stdev=1138.71, samples=92
  lat (nsec)   : 750=0.33%, 1000=0.58%
  lat (usec)   : 2=2.03%, 4=2.35%, 10=2.12%, 20=1.67%, 50=1.83%
  lat (usec)   : 100=2.14%, 250=10.03%, 500=23.73%, 750=16.45%, 1000=10.28%
  lat (msec)   : 2=16.70%, 4=6.30%, 10=1.93%, 20=0.54%, 50=0.35%
  lat (msec)   : 100=0.09%, 250=0.09%, 500=0.02%, 750=0.17%, 1000=0.25%
  lat (msec)   : 2000=0.02%
  cpu          : usr=1.90%, sys=33.46%, ctx=211915, majf=0, minf=0
  IO depths    : 1=0.7%, 2=5.4%, 4=55.0%, 8=38.9%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.6%, 8=4.4%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,97614,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=25.0MiB/s (26.2MB/s), 6300KiB/s-6495KiB/s (6451kB/s-6651kB/s), io=1507MiB (1580MB), run=60233-60275msec