results/test1/file/c/fio-512.txt
random-write: (g=0): rw=randwrite, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=posixaio, iodepth=8
...
fio-3.34
Starting 4 processes
random-write: Laying out IO file (1 file / 4096MiB)
random-write: Laying out IO file (1 file / 4096MiB)
Jobs: 4 (f=4): [w(4)][100.0%][w=3049KiB/s][w=6099 IOPS][eta 00m:00s]
random-write: (groupid=0, jobs=1): err= 0: pid=1099: Sat Mar 16 19:01:11 2024
  write: IOPS=1709, BW=855KiB/s (875kB/s)(50.1MiB/60031msec); 0 zone resets
    slat (nsec): min=471, max=40752k, avg=69944.90, stdev=400738.80
    clat (nsec): min=561, max=827434k, avg=4467846.78, stdev=47965626.03
     lat (usec): min=21, max=827438, avg=4537.79, stdev=47964.33
    clat percentiles (nsec):
     |  1.00th=[     1256],  5.00th=[     6368], 10.00th=[    69120],
     | 20.00th=[   232448], 30.00th=[   325632], 40.00th=[   423936],
     | 50.00th=[   518144], 60.00th=[   651264], 70.00th=[   823296],
     | 80.00th=[  1122304], 90.00th=[  1794048], 95.00th=[  2736128],
     | 99.00th=[ 17170432], 99.50th=[379584512], 99.90th=[725614592],
     | 99.95th=[750780416], 99.99th=[759169024]
   bw (  KiB/s): min=    2, max= 2113, per=32.59%, avg=1057.28, stdev=476.08, samples=97
   iops        : min=    4, max= 4226, avg=2114.64, stdev=952.16, samples=97
  lat (nsec)   : 750=0.27%, 1000=0.35%
  lat (usec)   : 2=1.50%, 4=2.02%, 10=1.98%, 20=1.56%, 50=1.81%
  lat (usec)   : 100=1.69%, 250=11.02%, 500=26.14%, 750=17.68%, 1000=10.58%
  lat (msec)   : 2=15.04%, 4=5.57%, 10=1.54%, 20=0.35%, 50=0.30%
  lat (msec)   : 100=0.03%, 250=0.02%, 500=0.11%, 750=0.40%, 1000=0.05%
  cpu          : usr=1.96%, sys=32.03%, ctx=210293, majf=0, minf=0
  IO depths    : 1=0.7%, 2=5.3%, 4=54.9%, 8=39.1%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.6%, 8=4.4%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,102608,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1100: Sat Mar 16 19:01:11 2024
  write: IOPS=1518, BW=759KiB/s (777kB/s)(44.5MiB/60032msec); 0 zone resets
    slat (nsec): min=411, max=43442k, avg=69864.91, stdev=368988.35
    clat (nsec): min=572, max=826865k, avg=5065632.85, stdev=50789978.51
     lat (usec): min=18, max=826868, avg=5135.50, stdev=50788.95
    clat percentiles (nsec):
     |  1.00th=[     1448],  5.00th=[     8032], 10.00th=[   199680],
     | 20.00th=[   301056], 30.00th=[   419840], 40.00th=[   497664],
     | 50.00th=[   618496], 60.00th=[   765952], 70.00th=[   970752],
     | 80.00th=[  1318912], 90.00th=[  2056192], 95.00th=[  3129344],
     | 99.00th=[ 21364736], 99.50th=[541065216], 99.90th=[725614592],
     | 99.95th=[750780416], 99.99th=[767557632]
   bw (  KiB/s): min=    2, max= 1592, per=28.65%, avg=929.48, stdev=442.22, samples=98
   iops        : min=    4, max= 3184, avg=1859.12, stdev=884.43, samples=98
  lat (nsec)   : 750=0.22%, 1000=0.26%
  lat (usec)   : 2=1.28%, 4=1.95%, 10=1.73%, 20=1.31%, 50=1.50%
  lat (usec)   : 100=0.35%, 250=7.00%, 500=24.63%, 750=19.05%, 1000=11.92%
  lat (msec)   : 2=18.38%, 4=7.03%, 10=1.92%, 20=0.41%, 50=0.37%
  lat (msec)   : 100=0.04%, 250=0.03%, 500=0.12%, 750=0.45%, 1000=0.06%
  cpu          : usr=1.80%, sys=36.10%, ctx=192633, majf=0, minf=0
  IO depths    : 1=0.6%, 2=4.7%, 4=53.9%, 8=40.8%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.0%, 8=4.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,91141,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1101: Sat Mar 16 19:01:11 2024
  write: IOPS=1704, BW=852KiB/s (873kB/s)(50.0MiB/60031msec); 0 zone resets
    slat (nsec): min=421, max=40488k, avg=65299.90, stdev=350695.12
    clat (nsec): min=521, max=827110k, avg=4497354.65, stdev=47933246.78
     lat (usec): min=19, max=827114, avg=4562.65, stdev=47932.87
    clat percentiles (nsec):
     |  1.00th=[     1320],  5.00th=[     7968], 10.00th=[    92672],
     | 20.00th=[   234496], 30.00th=[   329728], 40.00th=[   423936],
     | 50.00th=[   522240], 60.00th=[   659456], 70.00th=[   847872],
     | 80.00th=[  1155072], 90.00th=[  1826816], 95.00th=[  2736128],
     | 99.00th=[ 18743296], 99.50th=[379584512], 99.90th=[725614592],
     | 99.95th=[750780416], 99.99th=[759169024]
   bw (  KiB/s): min=    1, max= 2150, per=32.50%, avg=1054.48, stdev=459.71, samples=97
   iops        : min=    2, max= 4300, avg=2109.09, stdev=919.41, samples=97
  lat (nsec)   : 750=0.26%, 1000=0.34%
  lat (usec)   : 2=1.30%, 4=1.81%, 10=1.79%, 20=1.38%, 50=1.75%
  lat (usec)   : 100=1.68%, 250=11.44%, 500=26.38%, 750=17.31%, 1000=10.33%
  lat (msec)   : 2=15.53%, 4=5.87%, 10=1.51%, 20=0.36%, 50=0.33%
  lat (msec)   : 100=0.04%, 250=0.03%, 500=0.11%, 750=0.40%, 1000=0.05%
  cpu          : usr=1.98%, sys=31.95%, ctx=206497, majf=0, minf=0
  IO depths    : 1=0.6%, 2=5.0%, 4=54.6%, 8=39.7%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=95.8%, 8=4.2%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,102343,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8
random-write: (groupid=0, jobs=1): err= 0: pid=1102: Sat Mar 16 19:01:11 2024
  write: IOPS=1553, BW=777KiB/s (795kB/s)(45.5MiB/60031msec); 0 zone resets
    slat (nsec): min=400, max=41224k, avg=62704.39, stdev=353321.10
    clat (nsec): min=541, max=825177k, avg=4966892.28, stdev=50218513.82
     lat (usec): min=19, max=825181, avg=5029.60, stdev=50218.37
    clat percentiles (nsec):
     |  1.00th=[     1448],  5.00th=[    11072], 10.00th=[   214016],
     | 20.00th=[   317440], 30.00th=[   428032], 40.00th=[   509952],
     | 50.00th=[   626688], 60.00th=[   765952], 70.00th=[   970752],
     | 80.00th=[  1318912], 90.00th=[  2039808], 95.00th=[  3031040],
     | 99.00th=[ 20054016], 99.50th=[463470592], 99.90th=[725614592],
     | 99.95th=[750780416], 99.99th=[759169024]
   bw (  KiB/s): min=    3, max= 1797, per=29.60%, avg=960.92, stdev=450.43, samples=97
   iops        : min=    6, max= 3594, avg=1922.00, stdev=900.87, samples=97
  lat (nsec)   : 750=0.21%, 1000=0.28%
  lat (usec)   : 2=1.18%, 4=1.63%, 10=1.52%, 20=1.24%, 50=1.43%
  lat (usec)   : 100=0.33%, 250=6.05%, 500=25.11%, 750=19.87%, 1000=12.17%
  lat (msec)   : 2=18.69%, 4=7.02%, 10=1.88%, 20=0.40%, 50=0.32%
  lat (msec)   : 100=0.04%, 250=0.03%, 500=0.12%, 750=0.44%, 1000=0.06%
  cpu          : usr=1.89%, sys=37.41%, ctx=199549, majf=0, minf=0
  IO depths    : 1=0.5%, 2=4.3%, 4=52.4%, 8=42.8%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=96.4%, 8=3.6%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,93270,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
  WRITE: bw=3243KiB/s (3321kB/s), 759KiB/s-855KiB/s (777kB/s-875kB/s), io=190MiB (199MB), run=60031-60032msec